#+NAME: META
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | TADA(d)

** Restart Hasura
   #+NAME: iteration loop
   #+BEGIN_SRC tmate 
     #:dir ~/ii/apisnoop_v3/apps/hasura
     cd ~/ii/apisnoop_v3/apps/hasura
     echo docker-compose down
     docker-compose down
     # drop all data while down
     echo 'drop table raw_swaggers cascade; drop table raw_audit_events cascade; drop schema hdb_views cascade; drop schema hdb_catalog cascade; drop table zraw_audit_events cascade;' | psql
     echo docker-compose up
     docker-compose up -d
   #+END_SRC

   #+RESULTS: iteration loop
   #+begin_EXAMPLE
   #+end_EXAMPLE

** setting up the hasura postgresql-permissions
   
Run the following as the postgres user via psql:
https://docs.hasura.io/1.0/graphql/manual/deployment/postgres-permissions.html

#+NAME: hasura-user
#+BEGIN_SRC shell :results silent
echo -n $USER
#+END_SRC

#+NAME: create database and granting all privs to a user
#+BEGIN_SRC sql-mode :noweb yes :tangle ../apps/hasura/db_setup.sql
create database <<hasura-user()>>;
-- create user myuser with encrypted password 'mypass';
grant all privileges on database <<hasura-user()>> to <<hasura-user()>>;
create role dba with superuser noinherit;
grant dba to <<hasura-user()>>;
\connect <<hasura-user()>>
-- we write python functions
CREATE EXTENSION IF NOT EXISTS "uuid-ossp";
CREATE EXTENSION IF NOT EXISTS plpython3u;
CREATE EXTENSION IF NOT EXISTS plsh;
CREATE EXTENSION IF NOT EXISTS pgcrypto;
CREATE EXTENSION IF NOT EXISTS pg_trgm;
CREATE SCHEMA IF NOT EXISTS hdb_catalog;
CREATE SCHEMA IF NOT EXISTS hdb_views;
-- make the user an owner of system schemas
ALTER SCHEMA hdb_catalog OWNER TO <<hasura-user()>>;
ALTER SCHEMA hdb_views OWNER TO <<hasura-user()>>;
GRANT SELECT ON ALL TABLES IN SCHEMA information_schema TO <<hasura-user()>>;
GRANT SELECT ON ALL TABLES IN SCHEMA pg_catalog TO <<hasura-user()>>;
GRANT USAGE ON SCHEMA public TO <<hasura-user()>>;
GRANT ALL ON ALL TABLES IN SCHEMA public TO <<hasura-user()>>;
GRANT ALL ON ALL SEQUENCES IN SCHEMA public TO <<hasura-user()>>;
GRANT pg_execute_server_program TO <<hasura-user()>>;
#+END_SRC

#+RESULTS: create database and granting all privs to a user
#+begin_src sql-mode
ERROR:  database "zz" already exists
WARNING:  no privileges were granted for "zz"
GRANT
ERROR:  must be superuser to create superusers
ERROR:  must be superuser to alter superusers
SSL connection (protocol: TLSv1.3, cipher: TLS_AES_256_GCM_SHA384, bits: 256, compression: off)
You are now connected to database "zz" as user "zz".
NOTICE:  extension "uuid-ossp" already exists, skipping
CREATE EXTENSION
NOTICE:  extension "plpython3u" already exists, skipping
CREATE EXTENSION
ERROR:  permission denied to create extension "plsh"
HINT:  Must be superuser to create this extension.
NOTICE:  extension "pgcrypto" already exists, skipping
CREATE EXTENSION
NOTICE:  schema "hdb_catalog" already exists, skipping
CREATE SCHEMA
NOTICE:  schema "hdb_views" already exists, skipping
CREATE SCHEMA
ALTER SCHEMA
ALTER SCHEMA
WARNING:  no privileges were granted for "sql_features"
WARNING:  no privileges were granted for "sql_implementation_info"
WARNING:  no privileges were granted for "sql_languages"
WARNING:  no privileges were granted for "sql_packages"
WARNING:  no privileges were granted for "sql_parts"
WARNING:  no privileges were granted for "sql_sizing"
WARNING:  no privileges were granted for "sql_sizing_profiles"
WARNING:  no privileges were granted for "collations"
WARNING:  no privileges were granted for "collation_character_set_applicability"
WARNING:  no privileges were granted for "column_domain_usage"
WARNING:  no privileges were granted for "constraint_column_usage"
WARNING:  no privileges were granted for "domains"
WARNING:  no privileges were granted for "constraint_table_usage"
WARNING:  no privileges were granted for "domain_constraints"
WARNING:  no privileges were granted for "role_column_grants"
WARNING:  no privileges were granted for "enabled_roles"
WARNING:  no privileges were granted for "referential_constraints"
WARNING:  no privileges were granted for "parameters"
WARNING:  no privileges were granted for "routine_privileges"
WARNING:  no privileges were granted for "role_routine_grants"
WARNING:  no privileges were granted for "routines"
WARNING:  no privileges were granted for "schemata"
WARNING:  no privileges were granted for "table_constraints"
WARNING:  no privileges were granted for "sequences"
WARNING:  no privileges were granted for "triggered_update_columns"
WARNING:  no privileges were granted for "table_privileges"
WARNING:  no privileges were granted for "role_table_grants"
WARNING:  no privileges were granted for "triggers"
WARNING:  no privileges were granted for "tables"
WARNING:  no privileges were granted for "transforms"
WARNING:  no privileges were granted for "role_udt_grants"
WARNING:  no privileges were granted for "udt_privileges"
WARNING:  no privileges were granted for "role_usage_grants"
WARNING:  no privileges were granted for "usage_privileges"
WARNING:  no privileges were granted for "user_defined_types"
WARNING:  no privileges were granted for "view_column_usage"
WARNING:  no privileges were granted for "view_routine_usage"
WARNING:  no privileges were granted for "view_table_usage"
WARNING:  no privileges were granted for "views"
WARNING:  no privileges were granted for "data_type_privileges"
WARNING:  no privileges were granted for "user_mapping_options"
WARNING:  no privileges were granted for "element_types"
WARNING:  no privileges were granted for "_pg_foreign_table_columns"
WARNING:  no privileges were granted for "column_options"
WARNING:  no privileges were granted for "_pg_foreign_data_wrappers"
WARNING:  no privileges were granted for "foreign_data_wrapper_options"
WARNING:  no privileges were granted for "user_mappings"
WARNING:  no privileges were granted for "foreign_data_wrappers"
WARNING:  no privileges were granted for "_pg_foreign_servers"
WARNING:  no privileges were granted for "foreign_server_options"
WARNING:  no privileges were granted for "foreign_servers"
WARNING:  no privileges were granted for "_pg_foreign_tables"
WARNING:  no privileges were granted for "key_column_usage"
WARNING:  no privileges were granted for 
#+end_src

#+NAME: as posgres admin, setup hasura user and db
#+BEGIN_SRC tmate
#+BEGIN_SRC shell  :var SUDO_ASKPASS="/usr/bin/ssh-askpass" :prologue "export SUDO_ASKPASS"
# :var DISPLAY=":0.0"
sudo su - postgres -c psql < ~/ii/apisnoop_v3/apps/hasura/db_setup.sql
#+END_SRC

#+RESULTS: as posgres admin, setup hasura user and db
#+begin_EXAMPLE
#+end_EXAMPLE

** start hasura

#+BEGIN_SRC shell :dir hasura
docker-compose up -d
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE
** load audit_events_via local cli

#+BEGIN_SRC sql-mode
  \d raw_audit_events;
  -- delete from raw_audit_events;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
                                   Table "public.raw_audit_events"
   Column    |            Type             | Collation | Nullable |             Default              
-------------+-----------------------------+-----------+----------+----------------------------------
 id          | integer                     |           | not null | generated by default as identity
 ingested_at | timestamp without time zone |           |          | CURRENT_TIMESTAMP
 bucket      | text                        |           |          | 
 job         | text                        |           |          | 
 data        | jsonb                       |           | not null | 
Indexes:
    "raw_audit_events_pkey" PRIMARY KEY, btree (id)

#+end_src


#+NAME: load_audit_events.sh
#+BEGIN_SRC shell :var AUDIT_LOG="../data/artifacts/ci-kubernetes-e2e-gci-gce/1134962072287711234/combined-audit.log"
  BUCKET='ci-kubernetes-e2e-gci-gce'
  JOB='1134962072287711234'
  SQL="
  CREATE TEMPORARY TABLE raw_audit_events_import (data jsonb not null) ;
  copy raw_audit_events_import (data)
  FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');
  INSERT INTO raw_audit_events(data, bucket, job, audit_id)
  SELECT data, '$BUCKET', '$JOB'
  FROM raw_audit_events_import;
  "
  cat $AUDIT_LOG | psql -c "$SQL"
  date
#+END_SRC

#+RESULTS: load_audit_events.sh
#+begin_EXAMPLE
Sun Aug 11 21:09:02 UTC 2019
#+end_EXAMPLE

#+BEGIN_SRC sql-mode
  select distinct bucket, job from raw_audit_events;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
 bucket  | job  
---------+------
 bucket1 | job1
(1 row)

#+end_src

#+BEGIN_SRC sql-mode
\dt+
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
                          List of relations
 Schema |       Name       | Type  | Owner |    Size    | Description 
--------+------------------+-------+-------+------------+-------------
 public | audit_events     | table | zz    | 8192 bytes | 
 public | raw_audit_events | table | zz    | 376 MB     | 
 public | raw_swaggers     | table | zz    | 1752 kB    | 
(3 rows)

#+end_src

**** Load Audit Events
     
     We need to match our event to an operation ID.
     An operation ID is unique on raw_swagger_id, http method, and regex.
     So we should try to match the vent on the same three.
     raw.data ->> 'requestURI' ~ ops.regex
     raw.data ->> 'verb' = 
     ops.raw_swagger_id = 1
 #+NAME: experimental load_audit_events.sh
 #+BEGIN_SRC shell :var AUDIT_LOG="../data/artifacts/ci-kubernetes-e2e-gci-gce/1134962072287711234/combined-audit.log"

  BUCKET='ci-kubernetes-e2e-gci-gce'
  JOB='1134962072287711234'
  SQL="
  CREATE TEMPORARY TABLE raw_audit_events_import (data jsonb not null) ;
  copy raw_audit_events_import (data)
  FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');
  INSERT INTO zraw_audit_events(data, bucket, job, audit_id, event_verb, request_uri, operation_id)
  SELECT raw.data, '$BUCKET', '$JOB', (raw.data ->> 'auditID'), (raw.data ->> 'verb'), (raw.data ->> 'requestURI'), ops.operation_id
  FROM raw_audit_events_import raw
  LEFT JOIN api_operations_material ops ON
       ops.raw_swagger_id = 1
       AND raw.data ->> 'verb' = ops.event_verb
       AND raw.data ->> 'requestURI' ~ ops.regex;
  "
  cat $AUDIT_LOG | psql -c "$SQL" 2>&1
  date
 #+END_SRC

 #+RESULTS: experimental load_audit_events.sh
 #+begin_EXAMPLE
 INSERT 0 313431
 Mon Aug 12 22:41:18 UTC 2019
 #+end_EXAMPLE
 ** event_verb_to_http_method

  
 #+BEGIN_SRC sql-mode
SELECT DISTINCT audit_id, operation_id
FROM zraw_audit_events;
 #+END_SRC
 
 #+NAME: Distinct Key
 #+BEGIN_SRC sql-mode
select distinct data->'requestObject'->>'kind' as keys
from zraw_audit_events
order by keys;
 #+END_SRC

 #+RESULTS: Distinct Keys
 #+begin_src sql-mode
               keys              
 --------------------------------
  APIService
  Binding
  CertificateSigningRequest
  ClusterRole
  ClusterRoleBinding
  ControllerRevision
  CronJob
  CSIDriver
  CSINode
  CustomResourceDefinition
  DaemonSet
  DeleteOptions
  Deployment
  DeploymentRollback
  Endpoints
  HorizontalPodAutoscaler
  Job
  LimitRange
  MutatingWebhookConfiguration
  Namespace
  Node
  PersistentVolume
  PersistentVolumeClaim
  Pod
  PodDisruptionBudget
  PodSecurityPolicy
  PodTemplate
  PriorityClass
  ReplicaSet
  ReplicationController
  ResourceQuota
  Role
  RoleBinding
  RuntimeClass
  Scale
  Service
  ServiceAccount
  StatefulSet
  StorageClass
  SubjectAccessReview
  ValidatingWebhookConfiguration
  VolumeAttachment
 (43 rows)

 #+end_src

 
 - we did a join, and got 50k results, which seemed too small.
 - the join is based on matching regex, event_verb, and raw_swagger_id 
 - raw events is 300k, it shoudl be closer to that?
 - what is the reason for nulls?  how often is i
 #+NAME: Audit_events without matching operations: sample
 #+BEGIN_SRC sql-mode
   SELECT
     distinct event_verb
   FROM
     zraw_audit_events
   LIMIT 50;
 #+END_SRC

 #+RESULTS: Audit_events without matching operations: sample
 #+begin_src sql-mode
     event_verb    
 ------------------
  list
  deletecollection
  delete
  update
  get
  create
  post
  abcd
  watch
  patch
 (10 rows)

 #+end_src

 #+BEGIN_SRC sql-mode
   SELECT
     path, regex
   FROM
     api_operations_material 
    WHERE
      path LIKE '/apis/authorization.k8s.io/v1beta1/subjectaccessreviews%';

 #+END_SRC
 
 #+BEGIN_SRC sql-mode
select distinct param_kind from api_resources_fields order by param_kind;
-- select * from api_resources_fields where param_kind ilike '%PodSpec';
 #+END_SRC


 #+RESULTS:
 #+begin_src sql-mode
                                            param_kind                                            
 -------------------------------------------------------------------------------------------------
  integer
  io.k8s.api.admissionregistration.v1beta1.MutatingWebhookConfiguration
  io.k8s.api.admissionregistration.v1beta1.RuleWithOperations
  io.k8s.api.admissionregistration.v1beta1.ValidatingWebhookConfiguration
  io.k8s.api.admissionregistration.v1beta1.WebhookClientConfig
  io.k8s.api.admissionregistration.v1.MutatingWebhookConfiguration
  io.k8s.api.admissionregistration.v1.RuleWithOperations
  io.k8s.api.admissionregistration.v1.ValidatingWebhookConfiguration
  io.k8s.api.admissionregistration.v1.WebhookClientConfig
  io.k8s.api.apps.v1beta1.ControllerRevision
  io.k8s.api.apps.v1beta1.Deployment
  io.k8s.api.apps.v1beta1.DeploymentStrategy
  io.k8s.api.apps.v1beta1.RollbackConfig
  io.k8s.api.apps.v1beta1.StatefulSet
  io.k8s.api.apps.v1beta1.StatefulSetCondition
  io.k8s.api.apps.v1beta1.StatefulSetUpdateStrategy
  io.k8s.api.apps.v1beta2.ControllerRevision
  io.k8s.api.apps.v1beta2.DaemonSet
  io.k8s.api.apps.v1beta2.DaemonSetCondition
  io.k8s.api.apps.v1beta2.DaemonSetUpdateStrategy
  io.k8s.api.apps.v1beta2.Deployment
  io.k8s.api.apps.v1beta2.DeploymentStrategy
  io.k8s.api.apps.v1beta2.ReplicaSet
  io.k8s.api.apps.v1beta2.ReplicaSetCondition
  io.k8s.api.apps.v1beta2.StatefulSet
  io.k8s.api.apps.v1beta2.StatefulSetCondition
  io.k8s.api.apps.v1beta2.StatefulSetUpdateStrategy
  io.k8s.api.apps.v1.ControllerRevision
  io.k8s.api.apps.v1.DaemonSet
  io.k8s.api.apps.v1.DaemonSetCondition
  io.k8s.api.apps.v1.DaemonSetUpdateStrategy
  io.k8s.api.apps.v1.Deployment
  io.k8s.api.apps.v1.DeploymentStrategy
  io.k8s.api.apps.v1.ReplicaSet
  io.k8s.api.apps.v1.ReplicaSetCondition
  io.k8s.api.apps.v1.StatefulSet
  io.k8s.api.apps.v1.StatefulSetCondition
  io.k8s.api.apps.v1.StatefulSetUpdateStrategy
  io.k8s.api.auditregistration.v1alpha1.AuditSink
  io.k8s.api.auditregistration.v1alpha1.Policy
  io.k8s.api.auditregistration.v1alpha1.Webhook
  io.k8s.api.auditregistration.v1alpha1.WebhookClientConfig
  io.k8s.api.auditregistration.v1alpha1.WebhookThrottleConfig
  io.k8s.api.authentication.v1beta1.TokenReviewSpec
  io.k8s.api.authentication.v1beta1.TokenReviewStatus
  io.k8s.api.authentication.v1.BoundObjectReference
  io.k8s.api.authentication.v1.TokenRequestSpec
  io.k8s.api.authentication.v1.TokenRequestStatus
  io.k8s.api.authentication.v1.TokenReviewSpec
  io.k8s.api.authentication.v1.TokenReviewStatus
  io.k8s.api.authorization.v1beta1.NonResourceRule
  io.k8s.api.authorization.v1beta1.ResourceRule
  io.k8s.api.authorization.v1beta1.SelfSubjectAccessReviewSpec
  io.k8s.api.authorization.v1beta1.SelfSubjectRulesReviewSpec
  io.k8s.api.authorization.v1beta1.SubjectAccessReviewSpec
  io.k8s.api.authorization.v1beta1.SubjectAccessReviewStatus
  io.k8s.api.authorization.v1beta1.SubjectRulesReviewStatus
  io.k8s.api.authorization.v1.NonResourceRule
  io.k8s.api.authorization.v1.ResourceRule
  io.k8s.api.authorization.v1.SelfSubjectAccessReviewSpec
  io.k8s.api.authorization.v1.SelfSubjectRulesReviewSpec
  io.k8s.api.authorization.v1.SubjectAccessReviewSpec
  io.k8s.api.authorization.v1.SubjectAccessReviewStatus
  io.k8s.api.authorization.v1.SubjectRulesReviewStatus
  io.k8s.api.autoscaling.v1.CrossVersionObjectReference
  io.k8s.api.autoscaling.v1.HorizontalPodAutoscaler
  io.k8s.api.autoscaling.v2beta1.CrossVersionObjectReference
  io.k8s.api.autoscaling.v2beta1.ExternalMetricSource
  io.k8s.api.autoscaling.v2beta1.ExternalMetricStatus
  io.k8s.api.autoscaling.v2beta1.HorizontalPodAutoscaler
  io.k8s.api.autoscaling.v2beta1.HorizontalPodAutoscalerCondition
  io.k8s.api.autoscaling.v2beta1.MetricSpec
  io.k8s.api.autoscaling.v2beta1.MetricStatus
  io.k8s.api.autoscaling.v2beta1.ObjectMetricSource
  io.k8s.api.autoscaling.v2beta1.ObjectMetricStatus
  io.k8s.api.autoscaling.v2beta1.PodsMetricSource
  io.k8s.api.autoscaling.v2beta1.PodsMetricStatus
  io.k8s.api.autoscaling.v2beta1.ResourceMetricSource
  io.k8s.api.autoscaling.v2beta1.ResourceMetricStatus
  io.k8s.api.autoscaling.v2beta2.CrossVersionObjectReference
  io.k8s.api.autoscaling.v2beta2.ExternalMetricSource
  io.k8s.api.autoscaling.v2beta2.ExternalMetricStatus
  io.k8s.api.autoscaling.v2beta2.HorizontalPodAutoscaler
  io.k8s.api.autoscaling.v2beta2.HorizontalPodAutoscalerCondition
  io.k8s.api.autoscaling.v2beta2.MetricIdentifier
  io.k8s.api.autoscaling.v2beta2.MetricSpec
  io.k8s.api.autoscaling.v2beta2.MetricStatus
  io.k8s.api.autoscaling.v2beta2.MetricTarget
  io.k8s.api.autoscaling.v2beta2.MetricValueStatus
  io.k8s.api.autoscaling.v2beta2.ObjectMetricSource
  io.k8s.api.autoscaling.v2beta2.ObjectMetricStatus
  io.k8s.api.autoscaling.v2beta2.PodsMetricSource
  io.k8s.api.autoscaling.v2beta2.PodsMetricStatus
  io.k8s.api.autoscaling.v2beta2.ResourceMetricSource
  io.k8s.api.autoscaling.v2beta2.ResourceMetricStatus
  io.k8s.api.batch.v1beta1.CronJob
  io.k8s.api.batch.v1beta1.JobTemplateSpec
  io.k8s.api.batch.v1.Job
  io.k8s.api.batch.v2alpha1.CronJob
  io.k8s.api.batch.v2alpha1.JobTemplateSpec
  io.k8s.api.certificates.v1beta1.CertificateSigningRequest
  io.k8s.api.coordination.v1beta1.Lease
  io.k8s.api.coordination.v1.Lease
  io.k8s.api.core.v1.Affinity
  io.k8s.api.core.v1.AWSElasticBlockStoreVolumeSource
  io.k8s.api.core.v1.AzureDiskVolumeSource
  io.k8s.api.core.v1.AzureFileVolumeSource
  io.k8s.api.core.v1.CephFSVolumeSource
  io.k8s.api.core.v1.CinderVolumeSource
  io.k8s.api.core.v1.ComponentStatus
  io.k8s.api.core.v1.ConfigMap
  io.k8s.api.core.v1.ConfigMapVolumeSource
  io.k8s.api.core.v1.Container
  io.k8s.api.core.v1.ContainerPort
  io.k8s.api.core.v1.ContainerState
  io.k8s.api.core.v1.CSIVolumeSource
  io.k8s.api.core.v1.DownwardAPIVolumeSource
  io.k8s.api.core.v1.EmptyDirVolumeSource
  io.k8s.api.core.v1.Endpoints
  io.k8s.api.core.v1.EnvFromSource
  io.k8s.api.core.v1.EnvVar
  io.k8s.api.core.v1.EnvVarSource
  io.k8s.api.core.v1.EphemeralContainer
  io.k8s.api.core.v1.Event
  io.k8s.api.core.v1.EventSeries
  io.k8s.api.core.v1.EventSource
  io.k8s.api.core.v1.FCVolumeSource
  io.k8s.api.core.v1.FlexVolumeSource
  io.k8s.api.core.v1.FlockerVolumeSource
  io.k8s.api.core.v1.GCEPersistentDiskVolumeSource
  io.k8s.api.core.v1.GitRepoVolumeSource
  io.k8s.api.core.v1.GlusterfsVolumeSource
  io.k8s.api.core.v1.HostAlias
  io.k8s.api.core.v1.HostPathVolumeSource
  io.k8s.api.core.v1.HTTPHeader
  io.k8s.api.core.v1.ISCSIVolumeSource
  io.k8s.api.core.v1.Lifecycle
  io.k8s.api.core.v1.LimitRange
  io.k8s.api.core.v1.LimitRangeItem
  io.k8s.api.core.v1.LocalObjectReference
  io.k8s.api.core.v1.Namespace
  io.k8s.api.core.v1.NFSVolumeSource
  io.k8s.api.core.v1.Node
  io.k8s.api.core.v1.NodeSelectorTerm
  io.k8s.api.core.v1.ObjectFieldSelector
  io.k8s.api.core.v1.ObjectReference
  io.k8s.api.core.v1.PersistentVolume
  io.k8s.api.core.v1.PersistentVolumeClaim
  io.k8s.api.core.v1.PersistentVolumeClaimVolumeSource
  io.k8s.api.core.v1.PhotonPersistentDiskVolumeSource
  io.k8s.api.core.v1.Pod
  io.k8s.api.core.v1.PodAffinityTerm
  io.k8s.api.core.v1.PodDNSConfig
  io.k8s.api.core.v1.PodReadinessGate
  io.k8s.api.core.v1.PodSecurityContext
  io.k8s.api.core.v1.PodTemplate
  io.k8s.api.core.v1.PodTemplateSpec
  io.k8s.api.core.v1.PortworxVolumeSource
  io.k8s.api.core.v1.Probe
  io.k8s.api.core.v1.ProjectedVolumeSource
  io.k8s.api.core.v1.QuobyteVolumeSource
  io.k8s.api.core.v1.RBDVolumeSource
  io.k8s.api.core.v1.ReplicationController
  io.k8s.api.core.v1.ReplicationControllerCondition
  io.k8s.api.core.v1.ResourceFieldSelector
  io.k8s.api.core.v1.ResourceQuota
  io.k8s.api.core.v1.ResourceRequirements
  io.k8s.api.core.v1.ScaleIOVolumeSource
  io.k8s.api.core.v1.Secret
  io.k8s.api.core.v1.SecretReference
  io.k8s.api.core.v1.SecretVolumeSource
  io.k8s.api.core.v1.SecurityContext
  io.k8s.api.core.v1.SELinuxOptions
  io.k8s.api.core.v1.Service
  io.k8s.api.core.v1.ServiceAccount
  io.k8s.api.core.v1.StorageOSVolumeSource
  io.k8s.api.core.v1.Toleration
  io.k8s.api.core.v1.TopologySelectorTerm
  io.k8s.api.core.v1.TopologySpreadConstraint
  io.k8s.api.core.v1.Volume
  io.k8s.api.core.v1.VolumeDevice
  io.k8s.api.core.v1.VolumeMount
  io.k8s.api.core.v1.VolumeProjection
  io.k8s.api.core.v1.VsphereVirtualDiskVolumeSource
  io.k8s.api.events.v1beta1.Event
  io.k8s.api.events.v1beta1.EventSeries
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceColumnDefinition
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceConversion
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinition
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionCondition
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionNames
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionSpec
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionStatus
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceDefinitionVersion
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceSubresources
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.CustomResourceValidation
  io.k8s.apiextensions-apiserver.pkg.apis.apiextensions.v1beta1.WebhookClientConfig
  io.k8s.api.extensions.v1beta1.AllowedCSIDriver
  io.k8s.api.extensions.v1beta1.AllowedFlexVolume
  io.k8s.api.extensions.v1beta1.AllowedHostPath
  io.k8s.api.extensions.v1beta1.DaemonSet
  io.k8s.api.extensions.v1beta1.DaemonSetCondition
  io.k8s.api.extensions.v1beta1.DaemonSetUpdateStrategy
  io.k8s.api.extensions.v1beta1.Deployment
  io.k8s.api.extensions.v1beta1.DeploymentStrategy
  io.k8s.api.extensions.v1beta1.FSGroupStrategyOptions
  io.k8s.api.extensions.v1beta1.HostPortRange
  io.k8s.api.extensions.v1beta1.HTTPIngressPath
  io.k8s.api.extensions.v1beta1.IDRange
  io.k8s.api.extensions.v1beta1.Ingress
  io.k8s.api.extensions.v1beta1.IngressBackend
  io.k8s.api.extensions.v1beta1.NetworkPolicy
  io.k8s.api.extensions.v1beta1.NetworkPolicyEgressRule
  io.k8s.api.extensions.v1beta1.NetworkPolicyIngressRule
  io.k8s.api.extensions.v1beta1.PodSecurityPolicy
  io.k8s.api.extensions.v1beta1.ReplicaSet
  io.k8s.api.extensions.v1beta1.ReplicaSetCondition
  io.k8s.api.extensions.v1beta1.RollbackConfig
  io.k8s.api.extensions.v1beta1.RunAsGroupStrategyOptions
  io.k8s.api.extensions.v1beta1.RunAsUserStrategyOptions
  io.k8s.api.extensions.v1beta1.RuntimeClassStrategyOptions
  io.k8s.api.extensions.v1beta1.SELinuxStrategyOptions
  io.k8s.api.extensions.v1beta1.SupplementalGroupsStrategyOptions
  io.k8s.apimachinery.pkg.api.resource.Quantity
  io.k8s.apimachinery.pkg.apis.meta.v1.APIGroup
  io.k8s.apimachinery.pkg.apis.meta.v1.APIResource
  io.k8s.apimachinery.pkg.apis.meta.v1.GroupVersionForDiscovery
  io.k8s.apimachinery.pkg.apis.meta.v1.LabelSelector
  io.k8s.apimachinery.pkg.apis.meta.v1.ListMeta
  io.k8s.apimachinery.pkg.apis.meta.v1.MicroTime
  io.k8s.apimachinery.pkg.apis.meta.v1.ObjectMeta
  io.k8s.apimachinery.pkg.apis.meta.v1.ServerAddressByClientCIDR
  io.k8s.apimachinery.pkg.apis.meta.v1.Time
  io.k8s.apimachinery.pkg.runtime.RawExtension
  io.k8s.apimachinery.pkg.util.intstr.IntOrString
  io.k8s.api.networking.v1beta1.HTTPIngressPath
  io.k8s.api.networking.v1beta1.Ingress
  io.k8s.api.networking.v1beta1.IngressBackend
  io.k8s.api.networking.v1.NetworkPolicy
  io.k8s.api.networking.v1.NetworkPolicyEgressRule
  io.k8s.api.networking.v1.NetworkPolicyIngressRule
  io.k8s.api.node.v1alpha1.Overhead
  io.k8s.api.node.v1alpha1.RuntimeClass
  io.k8s.api.node.v1alpha1.RuntimeClassSpec
  io.k8s.api.node.v1alpha1.Scheduling
  io.k8s.api.node.v1beta1.Overhead
  io.k8s.api.node.v1beta1.RuntimeClass
  io.k8s.api.node.v1beta1.Scheduling
  io.k8s.api.policy.v1beta1.AllowedCSIDriver
  io.k8s.api.policy.v1beta1.AllowedFlexVolume
  io.k8s.api.policy.v1beta1.AllowedHostPath
  io.k8s.api.policy.v1beta1.FSGroupStrategyOptions
  io.k8s.api.policy.v1beta1.HostPortRange
  io.k8s.api.policy.v1beta1.IDRange
  io.k8s.api.policy.v1beta1.PodDisruptionBudget
  io.k8s.api.policy.v1beta1.PodSecurityPolicy
  io.k8s.api.policy.v1beta1.RunAsGroupStrategyOptions
  io.k8s.api.policy.v1beta1.RunAsUserStrategyOptions
  io.k8s.api.policy.v1beta1.RuntimeClassStrategyOptions
  io.k8s.api.policy.v1beta1.SELinuxStrategyOptions
  io.k8s.api.policy.v1beta1.SupplementalGroupsStrategyOptions
  io.k8s.api.rbac.v1alpha1.ClusterRole
  io.k8s.api.rbac.v1alpha1.ClusterRoleBinding
  io.k8s.api.rbac.v1alpha1.Role
  io.k8s.api.rbac.v1alpha1.RoleBinding
  io.k8s.api.rbac.v1alpha1.RoleRef
  io.k8s.api.rbac.v1alpha1.Subject
  io.k8s.api.rbac.v1beta1.ClusterRole
  io.k8s.api.rbac.v1beta1.ClusterRoleBinding
  io.k8s.api.rbac.v1beta1.Role
  io.k8s.api.rbac.v1beta1.RoleBinding
  io.k8s.api.rbac.v1beta1.RoleRef
  io.k8s.api.rbac.v1beta1.Subject
  io.k8s.api.rbac.v1.ClusterRole
  io.k8s.api.rbac.v1.ClusterRoleBinding
  io.k8s.api.rbac.v1.Role
  io.k8s.api.rbac.v1.RoleBinding
  io.k8s.api.rbac.v1.RoleRef
  io.k8s.api.rbac.v1.Subject
  io.k8s.api.scheduling.v1alpha1.PriorityClass
  io.k8s.api.scheduling.v1beta1.PriorityClass
  io.k8s.api.scheduling.v1.PriorityClass
  io.k8s.api.settings.v1alpha1.PodPreset
  io.k8s.api.storage.v1alpha1.VolumeAttachment
  io.k8s.api.storage.v1alpha1.VolumeAttachmentSource
  io.k8s.api.storage.v1alpha1.VolumeAttachmentSpec
  io.k8s.api.storage.v1alpha1.VolumeAttachmentStatus
  io.k8s.api.storage.v1alpha1.VolumeError
  io.k8s.api.storage.v1beta1.CSIDriver
  io.k8s.api.storage.v1beta1.CSIDriverSpec
  io.k8s.api.storage.v1beta1.CSINode
  io.k8s.api.storage.v1beta1.CSINodeDriver
  io.k8s.api.storage.v1beta1.CSINodeSpec
  io.k8s.api.storage.v1beta1.StorageClass
  io.k8s.api.storage.v1beta1.VolumeAttachment
  io.k8s.api.storage.v1beta1.VolumeAttachmentSource
  io.k8s.api.storage.v1beta1.VolumeAttachmentSpec
  io.k8s.api.storage.v1beta1.VolumeAttachmentStatus
  io.k8s.api.storage.v1beta1.VolumeError
  io.k8s.api.storage.v1beta1.VolumeNodeResources
  io.k8s.api.storage.v1.StorageClass
  io.k8s.api.storage.v1.VolumeAttachment
  io.k8s.api.storage.v1.VolumeAttachmentSource
  io.k8s.api.storage.v1.VolumeAttachmentSpec
  io.k8s.api.storage.v1.VolumeAttachmentStatus
  io.k8s.api.storage.v1.VolumeError
  io.k8s.kube-aggregator.pkg.apis.apiregistration.v1.APIService
  io.k8s.kube-aggregator.pkg.apis.apiregistration.v1beta1.APIService
  io.k8s.kube-aggregator.pkg.apis.apiregistration.v1beta1.ServiceReference
  io.k8s.kube-aggregator.pkg.apis.apiregistration.v1.ServiceReference
  string
 (311 rows)

 #+end_src
 
 #+BEGIN_SRC sql-mode
   select
      distinct request_uri
   from
     zraw_audit_events
   where 
     operation_id IS NULL
     AND event_verb = 'get'
     AND request_uri like '/api%'
     AND request_uri not like '%proxy%'
     AND request_uri like '%timeout%'

   order by request_uri
   LIMIT 500;
 #+END_SRC

 #+RESULTS:
 #+begin_src sql-mode
                                   request_uri                                   
 --------------------------------------------------------------------------------
  /apis/admissionregistration.k8s.io/v1beta1?timeout=32s
  /apis/apiextensions.k8s.io/v1beta1?timeout=32s
  /apis/apiregistration.k8s.io/v1beta1?timeout=32s
  /apis/apiregistration.k8s.io/v1?timeout=32s
  /apis/apps/v1beta1?timeout=32s
  /apis/apps/v1beta2?timeout=32s
  /apis/apps/v1?timeout=32s
  /apis/authentication.k8s.io/v1beta1?timeout=32s
  /apis/authentication.k8s.io/v1?timeout=32s
  /apis/authorization.k8s.io/v1beta1?timeout=32s
  /apis/authorization.k8s.io/v1?timeout=32s
  /apis/autoscaling/v1?timeout=32s
  /apis/autoscaling/v2beta1?timeout=32s
  /apis/autoscaling/v2beta2?timeout=32s
  /apis/batch/v1beta1?timeout=32s
  /apis/batch/v1?timeout=32s
  /apis/batch/v2alpha1?timeout=32s
  /apis/certificates.k8s.io/v1beta1?timeout=32s
  /apis/coordination.k8s.io/v1beta1?timeout=32s
  /apis/coordination.k8s.io/v1?timeout=32s
  /apis/crd-publish-openapi-test-common-group.k8s.io/v4?timeout=32s
  /apis/crd-publish-openapi-test-common-group.k8s.io/v5?timeout=32s
  /apis/crd-publish-openapi-test-common-group.k8s.io/v6?timeout=32s
  /apis/crd-publish-openapi-test-empty.k8s.io/v1?timeout=32s
  /apis/crd-publish-openapi-test-foo.k8s.io/v1?timeout=32s
  /apis/crd-publish-openapi-test-multi-to-single-ver.k8s.io/v5?timeout=32s
  /apis/crd-publish-openapi-test-multi-to-single-ver.k8s.io/v6alpha1?timeout=32s
  /apis/crd-publish-openapi-test-multi-ver.k8s.io/v2?timeout=32s
  /apis/crd-publish-openapi-test-multi-ver.k8s.io/v3?timeout=32s
  /apis/crd-publish-openapi-test-multi-ver.k8s.io/v4?timeout=32s
  /apis/crd-publish-openapi-test-waldo.k8s.io/v1beta1?timeout=32s
  /apis/discovery-crd-test.k8s.io/v1?timeout=32s
  /apis/events.k8s.io/v1beta1?timeout=32s
  /apis/extensions/v1beta1?timeout=32s
  /apis/kubectl-crd-test.k8s.io/v1?timeout=32s
  /apis/metrics.k8s.io/v1beta1?timeout=32s
  /apis/mygroup.example.com/v1beta1?timeout=32s
  /apis/networking.k8s.io/v1beta1?timeout=32s
  /apis/networking.k8s.io/v1?timeout=32s
  /apis/node.k8s.io/v1beta1?timeout=32s
  /apis/policy/v1beta1?timeout=32s
  /apis/rbac.authorization.k8s.io/v1beta1?timeout=32s
  /apis/rbac.authorization.k8s.io/v1?timeout=32s
  /apis/resourcequota-crd-test.k8s.io/v1?timeout=32s
  /apis/scalingpolicy.kope.io/v1alpha1?timeout=32s
  /apis/scheduling.k8s.io/v1alpha1?timeout=32s
  /apis/scheduling.k8s.io/v1beta1?timeout=32s
  /apis/scheduling.k8s.io/v1?timeout=32s
  /apis/settings.k8s.io/v1alpha1?timeout=32s
  /apis/snapshot.storage.k8s.io/v1alpha1?timeout=32s
  /apis/stable.example.com/v1?timeout=32s
  /apis/stable.example.com/v2?timeout=32s
  /apis/storage.k8s.io/v1beta1?timeout=32s
  /apis/storage.k8s.io/v1?timeout=32s
  /apis?timeout=32s
  /apis/wardle.k8s.io/v1alpha1?timeout=32s
  /apis/webhook-crd-test.k8s.io/v1?timeout=32s
  /apis/webhook-multiversion-crd-test.k8s.io/v1?timeout=32s
  /apis/webhook-multiversion-crd-test.k8s.io/v2?timeout=32s
  /api?timeout=32s
  /api/v1?timeout=32s
 (61 rows)

 #+end_src


** load audit_events_via local cli

#+BEGIN_SRC sql-mode
  \d raw_audit_events;
  -- delete from raw_audit_events;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
                                   Table "public.raw_audit_events"
   Column    |            Type             | Collation | Nullable |             Default              
-------------+-----------------------------+-----------+----------+----------------------------------
 id          | integer                     |           | not null | generated by default as identity
 ingested_at | timestamp without time zone |           |          | CURRENT_TIMESTAMP
 bucket      | text                        |           |          | 
 job         | text                        |           |          | 
 data        | jsonb                       |           | not null | 
Indexes:
    "raw_audit_events_pkey" PRIMARY KEY, btree (id)

#+end_src


#+NAME: load_audit_events.sh
#+BEGIN_SRC shell :var AUDIT_LOG="../data/artifacts/ci-kubernetes-e2e-gci-gce/1134962072287711234/combined-audit.log"
  BUCKET='ci-kubernetes-e2e-gci-gce'
  JOB='1134962072287711234'
  SQL="
  CREATE TEMPORARY TABLE raw_audit_events_import (data jsonb not null) ;
  copy raw_audit_events_import (data)
  FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');
  INSERT INTO raw_audit_events(data, bucket, job)
  SELECT data, '$BUCKET', '$JOB'
  FROM raw_audit_events_import;
  "
  cat $AUDIT_LOG | psql -c "$SQL"
  date
#+END_SRC

#+RESULTS: load_audit_events.sh
#+begin_EXAMPLE
INSERT 0 313431
Thu Aug  8 01:14:52 UTC 2019
#+end_EXAMPLE

#+BEGIN_SRC sql-mode
  select distinct bucket, job from raw_audit_events;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
 bucket  | job  
---------+------
 bucket1 | job1
(1 row)

#+end_src

#+BEGIN_SRC sql-mode
\dt+
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
                          List of relations
 Schema |       Name       | Type  | Owner |    Size    | Description 
--------+------------------+-------+-------+------------+-------------
 public | audit_events     | table | zz    | 8192 bytes | 
 public | raw_audit_events | table | zz    | 376 MB     | 
 public | raw_swaggers     | table | zz    | 1752 kB    | 
(3 rows)

#+end_src

# Local Variables:
# eval: (sql-connect "hasura" (concat "*SQL: postgres:data*"))
# End:
